pavellzubkov/jscan_esp/sdkconfig.defaults
# Целевые дефолты конфигурации сборки jscan_esp (ESP-IDF 6.1, чип ESP32)
# Сверены с рабочим sdkconfig; остальные опции — дефолты IDF.

CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_new.csv"

# OTA: bootloader откатывается на прошлое приложение, если новое не запустилось
# (esp_ota_mark_app_valid_cancel_rollback() в app_main подтверждает успешный старт).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
